АвтосервисАвтомагазин/src/Catalogs/КА2_КлючиМоделей/КА2_КлючиМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КА2_КлючиМоделей</name>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.КА2_Типы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.КА2_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КА2_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.КА2_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузов</name>
    <type>
      <types>CatalogRef.КА2_Кузова</types>
    </type>
  </attributes>
  <attributes>
    <name>Модификация</name>
    <type>
      <types>CatalogRef.КА2_Модификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплектация</name>
    <type>
      <types>CatalogRef.КА2_Комплектации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоколениеКузов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

АвтосервисАвтомагазин/src/Catalogs/КА2_КлючиМоделей/ObjectModule.bsl
// 
//	Аутсорсинг Групп 
//		+7 495 241 10 64
//		+7 3852 59 50 96
//		
//	Филимонов И.В.
//		+7 913 240 81 77
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда

		ДанныеЗаполнения.Свойство("ТипТС", ТипТС);
		ДанныеЗаполнения.Свойство("Марка", Марка);
		ДанныеЗаполнения.Свойство("Модель", Модель);
		ДанныеЗаполнения.Свойство("Поколение", Поколение);
		ДанныеЗаполнения.Свойство("Кузов", Кузов);
		ДанныеЗаполнения.Свойство("Модификация", Модификация);
		ДанныеЗаполнения.Свойство("Комплектация", Комплектация);

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДляНаименованияРазделитель = ", ";
	ДляПоколениеКузовРазделитель = " ";
	НеПустоеПоколениеКузов = Ложь;

	ДляНаименования = Новый Массив;
	ДляПоколениеКузов = Новый Массив;
		
	// Наименорвание марки
	ДляНаименования.Добавить(Строка(Марка));

	// Наименование модели
	Если ЗначениеЗаполнено(Модель) Тогда

		МодельНаименование = Строка(Модель);

		ДляНаименования.Добавить(ДляНаименованияРазделитель);
		ДляНаименования.Добавить(МодельНаименование);

		ДляПоколениеКузов.Добавить(МодельНаименование);
		НеПустоеПоколениеКузов = Истина;

	КонецЕсли;

	// Наименование поколения
	Если ЗначениеЗаполнено(Поколение) Тогда

		ПоколениеНаименование = Строка(Поколение);

		ДляНаименования.Добавить(ДляНаименованияРазделитель);
		ДляНаименования.Добавить(ПоколениеНаименование);

		Если НеПустоеПоколениеКузов Тогда
			ДляПоколениеКузов.Добавить(ДляПоколениеКузовРазделитель);
		Иначе
			НеПустоеПоколениеКузов = Истина;
		КонецЕсли;

		ГодыВыпускаСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Поколение, "year_begin, year_end");
		ГодыВыпуска = КА2_КаталогАвтомобилейКлиентСервер.ГодыВыпускаСтрока(ГодыВыпускаСтруктура.year_begin,
																		   ГодыВыпускаСтруктура.year_end);
		ДляПоколениеКузов.Добавить(ГодыВыпуска);

	КонецЕсли;

	// Наименование кузова
	Если ЗначениеЗаполнено(Кузов) Тогда
		КузовНаименование = Строка(Кузов);

		ДляНаименования.Добавить(ДляНаименованияРазделитель);
		ДляНаименования.Добавить(КузовНаименование);

		Если НеПустоеПоколениеКузов Тогда
			ДляПоколениеКузов.Добавить(ДляПоколениеКузовРазделитель);
		Иначе
			НеПустоеПоколениеКузов = Истина;
		КонецЕсли;

		ДляПоколениеКузов.Добавить(КузовНаименование);

	КонецЕсли;
			
	// Наименование модификации
	Если ЗначениеЗаполнено(Модификация) Тогда
		ДляНаименования.Добавить(ДляНаименованияРазделитель);
		ДляНаименования.Добавить(Строка(Модификация));
	КонецЕсли;
	
	// Наименование комплектации
	Если ЗначениеЗаполнено(Комплектация) Тогда
		ДляНаименования.Добавить(ДляНаименованияРазделитель);
		ДляНаименования.Добавить(Строка(Комплектация));
	КонецЕсли;

	Наименование = СтрСоединить(ДляНаименования);
	ПоколениеКузов = СтрСоединить(ДляПоколениеКузов);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
